# __author   :   TungShine
# __date     :   2017/8/21

data = {
    "四川省": {
        "成都市": {
            "高新区": {
                "软件园": {},
                "环球中心": {},
            },
            "武侯区": {
                "数码广场": {},
                "省体育馆": {},
            },
            "成华区": {
                "电子科技大学": {},
            },
        },
        "遂宁市": {
            "船山区": {},
            "安居区": {},
            "大英县": {},
        }
    },
    "北京市": {
        "北京市辖区": {
            "东城区": {
                "天安门": {},
            },
            "西城区": {
                "中关村": {},
            },
            "朝阳区": {
                "鸟巢": {},
            },
        },
    },
}

while True:
    for i in data:
        print(i)
    choice = input("b:返回上一级, a: 新增, d: 删除")
